# Pandas

In [3]:
import pandas as pd
import numpy as np

# Series & Index 설정

In [7]:
obj = pd.Series([4, 7, -5, 3],index = ['a','b','c','d'])

In [8]:
obj.values

array([ 4,  7, -5,  3])

In [9]:
obj.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
#Dict -> 자료형으로 변경하기
sdata = {'Kim': 35000, 'Beomwoo': 67000, 'Joan': 12000, 'Choi': 4000}
obj3 = pd.Series(sdata)
obj3

Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
dtype: int64

In [13]:
#이름 설정 & index 설정
obj3.name = "NAME"
obj3.index.name = "Names"
obj3

Names
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: NAME, dtype: int64

# DataFrame - series를 여러 개 합친

In [17]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
#DataFrame만들가
df=pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [25]:
#열 이름 바꾸기
df.columns = ['1','2','3','4','5']
#행 이름 바꾸기
df.index = ['a','b','c']
df

   1  2  3   4   5
a  1  4  7  10  13
b  2  5  8  11  14
c  3  6  9  12  15

In [26]:
#열 이름 바꾸기
df.rename(columns={'1':'0'}, inplace = True)
df

   0  2  3   4   5
a  1  4  7  10  13
b  2  5  8  11  14
c  3  6  9  12  15

In [27]:
#복사 -> DROP

df2=df.copy()
#행 drop
df2.drop('a',inplace=True)
#열 drop
df2.drop('3',axis=1,inplace=True)
df2

   0  2   4   5
b  2  5  11  14
c  3  6  12  15

# DataFrame indexing
loc = 이름으로 indexing
iloc = 숫자로 indexing

In [4]:
exam_data = {'수학':[90,80,70], '영어':[98,89,95],
            '음악':[85,95,100], '체육':[100,90,90]}

In [5]:
df4 = pd.DataFrame(exam_data, index = ['a','b','c'])
df4

   수학  영어   음악   체육
a  90  98   85  100
b  80  89   95   90
c  70  95  100   90

In [45]:
#row기준으로 자르기 
label1 = df4.loc['b'] #index b / row b 가져오기
label2 = df4.iloc[2] #두번째 position (즉 c) 가져오기
label1
label2

수학     70
영어     95
음악    100
체육     90
Name: c, dtype: int64

In [46]:
#row기준으로 자르기 (2개이상) #이러면 data frame으로 가져옴 
label3 = df4.loc[['b','c']]
label3

   수학  영어   음악  체육
b  80  89   95  90
c  70  95  100  90

In [52]:
#열 기준으로 자르기 - dataframe으로 만들려면 "[[]]"
df4[['수학']] 
#2개 이상으로 열 자르기
df4[['수학','영어']]

   수학  영어
a  90  98
b  80  89
c  70  95

조건을 가지고 indexing

In [68]:
df4['수학'] > 70

a     True
b     True
c    False
Name: 수학, dtype: bool

In [1]:
#df4 '수학'열 에서 70 넘은 row 모두 다 출력 
df4.loc[df4['수학'] > 70,:]

NameError: name 'df4' is not defined

In [67]:
#df4 '수학'열 에서 80 넘은 row 모두 출력 & 열 출력할 것 설정모두 다 출력 
df4.loc[df4['수학'] > 70, ['영어','음악']]

   영어  음악
a  98  85
b  89  95

In [65]:
#조건 두개
df4.loc[(df4['수학']>70)&(df4['수학']<90),:]

   수학  영어  음악  체육
b  80  89  95  90

# Transpose, info, describe, shape

In [53]:
#transpose
df4.transpose()

      a   b    c
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [54]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 228.0+ bytes

In [55]:
df4.describe()

         수학         영어          음악          체육
count   3.0   3.000000    3.000000    3.000000
mean   80.0  94.000000   93.333333   93.333333
std    10.0   4.582576    7.637626    5.773503
min    70.0  89.000000   85.000000   90.000000
25%    75.0  92.000000   90.000000   90.000000
50%    80.0  95.000000   95.000000   90.000000
75%    85.0  96.500000   97.500000   95.000000
max    90.0  98.000000  100.000000  100.000000

In [57]:
df4.shape

(3, 4)

# Missing Value - DROP NaN

In [73]:
# Random 으로 만들기
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0  1.475888  1.140824  1.491178  1.706712
1  0.783424  0.160955  1.341453 -2.857206
2  1.578823 -1.575676 -2.089627 -0.970954
3 -1.035206 -2.449229  2.042044  0.172786
4 -1.074340 -0.079223  0.870535  1.272221
5 -0.287003  0.110617  1.115452 -0.611716

In [75]:
df.columns = ['a','b','c','d']
df.index = ['1','2','3','4','5','6']
df

          a         b         c         d
1  1.475888  1.140824  1.491178  1.706712
2  0.783424  0.160955  1.341453 -2.857206
3  1.578823 -1.575676 -2.089627 -0.970954
4 -1.035206 -2.449229  2.042044  0.172786
5 -1.074340 -0.079223  0.870535  1.272221
6 -0.287003  0.110617  1.115452 -0.611716

In [91]:
#임의로 NaN을 넣어버리겠음, e column에다가 넣음
df['e'] = [np.nan, np.nan, np.nan, 1, 1, 1]

#임의로 random사용해서 f열에 넣어버리겠음
df['f'] = np.random.randn(6,1)
df

          a         b         c         d    e         f
1  1.475888  1.140824  1.491178  1.706712  NaN -0.055893
2  0.783424  0.160955  1.341453 -2.857206  NaN  0.535557
3  1.578823 -1.575676 -2.089627 -0.970954  NaN -0.499262
4 -1.035206 -2.449229  2.042044  0.172786  1.0 -0.435033
5 -1.074340 -0.079223  0.870535  1.272221  1.0  0.410312
6 -0.287003  0.110617  1.115452 -0.611716  1.0 -0.335175

In [80]:
#NaN 없애기
df.dropna(how = 'any')

          a         b         c         d    e
4 -1.035206 -2.449229  2.042044  0.172786  1.0
5 -1.074340 -0.079223  0.870535  1.272221  1.0
6 -0.287003  0.110617  1.115452 -0.611716  1.0

In [81]:
#열 모든값이 null인경우에 drop
df.dropna(how = 'all')

          a         b         c         d    e
1  1.475888  1.140824  1.491178  1.706712  NaN
2  0.783424  0.160955  1.341453 -2.857206  NaN
3  1.578823 -1.575676 -2.089627 -0.970954  NaN
4 -1.035206 -2.449229  2.042044  0.172786  1.0
5 -1.074340 -0.079223  0.870535  1.272221  1.0
6 -0.287003  0.110617  1.115452 -0.611716  1.0

In [82]:
df.dropna(subset = ['e'], axis = 0)

          a         b         c         d    e
4 -1.035206 -2.449229  2.042044  0.172786  1.0
5 -1.074340 -0.079223  0.870535  1.272221  1.0
6 -0.287003  0.110617  1.115452 -0.611716  1.0

# Fill & Replace

In [83]:
#null에 fill
df.fillna(value=0.5)

          a         b         c         d    e
1  1.475888  1.140824  1.491178  1.706712  0.5
2  0.783424  0.160955  1.341453 -2.857206  0.5
3  1.578823 -1.575676 -2.089627 -0.970954  0.5
4 -1.035206 -2.449229  2.042044  0.172786  1.0
5 -1.074340 -0.079223  0.870535  1.272221  1.0
6 -0.287003  0.110617  1.115452 -0.611716  1.0

In [1]:
df.isnull()
print(df.isnull().sum())

NameError: name 'df' is not defined

In [85]:
#Replace null with 24
df.replace(np.nan, 24)

          a         b         c         d     e
1  1.475888  1.140824  1.491178  1.706712  24.0
2  0.783424  0.160955  1.341453 -2.857206  24.0
3  1.578823 -1.575676 -2.089627 -0.970954  24.0
4 -1.035206 -2.449229  2.042044  0.172786   1.0
5 -1.074340 -0.079223  0.870535  1.272221   1.0
6 -0.287003  0.110617  1.115452 -0.611716   1.0

# Correlation구하기

In [104]:
df['a'].corr(df['c'])

-0.5165647601642085

# 유익한 꼭 알았으면 하는것

In [6]:
df4

   수학  영어   음악   체육
a  90  98   85  100
b  80  89   95   90
c  70  95  100   90

In [9]:
df4.groupby(['수학'])['영어'].count()

수학
70    1
80    1
90    1
Name: 영어, dtype: int64

In [ ]:
#apply
def profit(s):
    return s + s * 0.10 # increase of 10%
data['new_price'] =data['price'].apply(profit)

In [11]:
df = pd.read_csv('books.csv')
#같이 적용
df[(df['num_pages']>500) & (df['year']>2010)].shape

(5, 10)

In [12]:
df.head()

,title,author,average_rating,isbn13,language_code,num_pages,ratings_count,text_reviews_count,publisher,year
0,The Hunchback of Notre-Dame,Victor Hugo,4.00,9780345472427,en-US,534.0,140,22,Modern Library,2004
1,La Cucina Di Lidia: Recipes and Memories from ...,Lidia Matticchio Bastianich,4.14,9780767914222,en-GB,288.0,48,3,Clarkson Potter,2003
2,Breach of Promise,James Scott Bell,4.00,9780310243878,eng,345.0,368,36,Zondervan,2004
3,Brief Interviews with Hideous Men,David Foster Wallace,3.86,9780349111889,eng,273.0,18335,1155,Abacus,2000
4,The Killing Dance (Anita Blake Vampire Hunter...,Laurell K. Hamilton,4.13,9780425209066,en-US,368.0,59524,946,Berkley Hardcover,2006

In [20]:
#Capitalize Brand name
#부분적으로 적용 
brands = ['Victor Hugo', 'James Scott Bell']
cond = df['author'].isin(brands) #is in 또는 ~df
df['author'][cond] = df['author'][cond].str.lower()
df['author'].unique() # total of 9 brands

/var/folders/zm/bdsm5q2x0013mg_466vd8gnm0000gn/T/ipykernel_47950/3827310455.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['author'][cond] = df['author'][cond].str.lower()

array(['victor hugo', 'lidia matticchio bastianich', 'james scott bell',
       ..., 'malvina g. vogel', 'michel de montaigne', 'giuliano hazan'],
      dtype=object)